{
    "Heart rate": "Heart rate, also known as pulse rate, refers to the number of times the heart contracts or beats per minute (bpm). It is a vital sign that reflects the cardiovascular function and overall health of an individual. Heart rate can be measured at various locations in the body, such as the wrist, neck, or chest, using a stethoscope, pulse oximeter, or electrocardiogram (ECG) machine. Normal resting heart rate typically ranges from 60 to 100 bpm in adults, although it can vary depending on factors such as age, fitness level, and physiological conditions. Monitoring heart rate is essential in assessing cardiac function, detecting abnormalities, and guiding treatment decisions in various medical conditions.",

    "SpO2": "Pulse oximetry is a non-invasive method used to measure the oxygen saturation of hemoglobin in arterial blood (SpO2). It involves placing a sensor, usually on the fingertip or earlobe, which emits light at two wavelengths through the skin to measure the oxygen saturation level. Pulse oximetry provides valuable information about the oxygen-carrying capacity of the blood and tissue oxygenation levels. Normal SpO2 levels typically range from 95% to 100%. Monitoring SpO2 is essential in assessing respiratory function, detecting hypoxemia, and guiding oxygen therapy in critically ill patients.",

    "Temp": "Body temperature refers to the degree of heat generated by the body's metabolic processes. It is regulated by the hypothalamus and maintained within a narrow range to ensure optimal physiological function. Body temperature can be measured using various methods, including oral, axillary, rectal, and tympanic thermometers. Normal body temperature for adults is approximately 36.5 to 37.5 degrees Celsius (97.7 to 99.5 degrees Fahrenheit). Abnormal body temperature, such as fever or hypothermia, can indicate underlying medical conditions and may require further evaluation and treatment.",

    "SBP": "Systolic Blood Pressure (SBP) is the highest pressure recorded in the arteries during the contraction phase of the cardiac cycle. It reflects the force exerted by the heart when pumping blood into the arteries. SBP is an essential indicator of cardiovascular function and is used to assess the risk of cardiovascular events such as heart attacks and strokes. Normal SBP values typically range from 90 to 120 millimeters of mercury (mmHg). Monitoring SBP is crucial in diagnosing and managing hypertension, cardiovascular disease, and other medical conditions.",

    "MAP": "Mean Arterial Pressure (MAP) represents the average pressure in a patient's arteries during one cardiac cycle. It is calculated using systolic and diastolic blood pressure measurements and is an important indicator of tissue perfusion and cardiovascular function. MAP is often used in critical care settings to guide fluid resuscitation and monitor hemodynamic stability. Normal MAP values typically range from 70 to 100 mmHg.",

    "DBP": "Diastolic Blood Pressure (DBP) is the lowest pressure recorded in the arteries during the relaxation phase of the cardiac cycle. It reflects the residual pressure in the arteries when the heart is at rest. DBP is an essential indicator of cardiovascular health and is used to assess the risk of cardiovascular events such as heart attacks and strokes. Normal DBP values typically range from 60 to 80 millimeters of mercury (mmHg). Monitoring DBP is crucial in diagnosing and managing hypertension, cardiovascular disease, and other medical conditions.",

    "Resp": "Respiration rate (RR) refers to the number of breaths taken per minute. It is a vital sign that reflects the efficiency of the respiratory system in gas exchange and ventilation. Respiratory rate can be influenced by various factors such as age, physical activity, and metabolic rate. Monitoring respiratory rate is crucial in assessing respiratory function, detecting respiratory distress, and managing conditions such as pneumonia, asthma, and chronic obstructive pulmonary disease (COPD). Normal respiratory rate typically ranges from 12 to 20 breaths per minute in adults.",

    "EtCO2": "End-tidal carbon dioxide (EtCO2) is the partial pressure of carbon dioxide (CO2) measured at the end of expiration, or the peak of the exhaled breath. It provides valuable information about ventilation and carbon dioxide elimination in the lungs. EtCO2 monitoring is commonly used in critical care settings, such as during mechanical ventilation or cardiopulmonary resuscitation (CPR), to assess ventilation adequacy, detect airway obstruction, and guide respiratory management. Normal EtCO2 levels typically range from 35 to 45 millimeters of mercury (mmHg).",

    "BaseExcess": "Base excess (BE) is a measure of the amount of excess or deficit of bicarbonate (HCO3-) ions in the blood compared to the normal physiological range. It reflects the body's metabolic acid-base status and is calculated using blood gas analysis. Base excess values greater than 0 indicate metabolic alkalosis, while values less than 0 indicate metabolic acidosis. Base excess is used in conjunction with other blood gas parameters to diagnose and manage acid-base disorders such as metabolic acidosis, respiratory acidosis, and metabolic alkalosis.",

    "HCO3": "Bicarbonate (HCO3-) is an important electrolyte and buffer in the blood that helps maintain acid-base balance and regulate pH levels. It is produced by the kidneys and plays a critical role in buffering metabolic acids and maintaining normal physiological function. Bicarbonate levels are tightly regulated by the body, and abnormalities can indicate underlying metabolic disorders such as metabolic acidosis or alkalosis. Monitoring bicarbonate levels is essential in diagnosing and managing acid-base disorders and electrolyte imbalances.",

    "FiO2": "The Fraction of Inspired Oxygen (FiO2) represents the concentration of oxygen in the air that is breathed in. It is expressed as a percentage and is essential for maintaining adequate tissue oxygenation. FiO2 can be adjusted using supplemental oxygen therapy to meet the oxygen requirements of patients with respiratory insufficiency or hypoxemia. Monitoring FiO2 levels is crucial in optimizing oxygen therapy and preventing complications associated with hypoxia.",

    "pH": "pH of blood is a measure of the acidity or alkalinity of blood and reflects the balance between acid and base components in the body. The pH scale ranges from 0 to 14, with a pH of 7 considered neutral. Blood pH is tightly regulated by the body within a narrow range (approximately 7.35 to 7.45) to maintain normal physiological function. Abnormal blood pH levels can indicate underlying medical conditions, such as acidosis (low pH) or alkalosis (high pH), and may require further evaluation and management.",

    "PaCO2": "The Partial Pressure of Carbon Dioxide (PaCO2) represents the partial pressure of carbon dioxide (CO2) dissolved in arterial blood. It is measured as part of arterial blood gas (ABG) analysis and provides valuable information about respiratory function and acid-base balance. PaCO2 levels are regulated by ventilation and can vary depending on factors such as respiratory rate and tidal volume. Abnormal PaCO2 levels can indicate respiratory acidosis or alkalosis and are crucial in diagnosing and managing respiratory disorders such as chronic obstructive pulmonary disease (COPD) and acute respiratory failure.",

    "SaO2": "Oxygen saturation from arterial blood (SaO2) measures the percentage of hemoglobin in arterial blood that is saturated with oxygen. It provides valuable information about the oxygen-carrying capacity of the blood and tissue oxygenation levels. SaO2 is typically measured using arterial blood gas (ABG) analysis or pulse oximetry and is essential in assessing respiratory function, detecting hypoxemia, and guiding oxygen therapy in critically ill patients. Normal SaO2 levels typically range from 95% to 100%.",

    "AST": "Aspartate Transaminase (AST), also known as serum glutamate oxaloacetate transaminase (SGOT), is an enzyme found in various tissues, including the liver, heart, and skeletal muscle. AST is released into the bloodstream when these tissues are damaged, making it a useful marker for assessing liver and cardiac health. Elevated AST levels may indicate liver injury, myocardial infarction (heart attack), or other medical conditions. AST levels are typically measured as part of liver function tests and cardiac enzyme studies.",

    "BUN": "Blood Urea Nitrogen (BUN) is a waste product formed in the liver from the breakdown of proteins. It is excreted by the kidneys and eliminated from the body through urine. BUN levels can vary depending on factors such as dietary protein intake, kidney function, and hydration status. Elevated BUN levels may indicate impaired kidney function, dehydration, or other medical conditions. BUN levels are typically measured as part of comprehensive metabolic panels (CMP) or renal function tests.",

    "Alkalinephos": "Alkaline Phosphatase (ALP) is an enzyme found in various tissues, including the liver, bones, kidneys, and intestines. It plays a crucial role in bone formation and mineralization, as well as liver function. Elevated ALP levels may indicate liver or bone disorders, such as hepatitis, cirrhosis, or bone metastases. ALP levels are typically measured as part of liver function tests and bone health assessments.",

    "Calcium": "Calcium is a mineral essential for various physiological processes, including bone formation, muscle contraction, nerve function, and blood clotting. It is primarily stored in bones and is regulated by hormones such as parathyroid hormone (PTH) and calcitonin. Abnormal calcium levels can indicate underlying medical conditions, such as hypercalcemia (elevated calcium levels) or hypocalcemia (low calcium levels). Calcium levels are typically measured as part of comprehensive metabolic panels (CMP) or electrolyte panels and are used in diagnosing and managing various disorders such as hyperparathyroidism, hypoparathyroidism, and osteoporosis.",

    "Chloride": "Chloride is an electrolyte essential for maintaining fluid balance, osmotic pressure, and acid-base balance in the body. It is primarily found in extracellular fluids and is regulated by the kidneys. Abnormal chloride levels can indicate underlying medical conditions, such as dehydration, kidney disorders, or metabolic acidosis or alkalosis. Chloride levels are typically measured as part of comprehensive metabolic panels (CMP) or electrolyte panels and are used in diagnosing and managing electrolyte imbalances and acid-base disorders.",

    "Creatinine": "Creatinine is a waste product generated by muscle metabolism and excreted by the kidneys. It is a reliable marker of kidney function and is used to assess renal health. Creatinine levels in the blood can increase when kidney function is impaired, leading to conditions such as acute kidney injury or chronic kidney disease. Creatinine levels are typically measured as part of comprehensive metabolic panels (CMP) or renal function tests.",

    "Bilirubin_direct": "Direct bilirubin is a component of total bilirubin that is conjugated in the liver and excreted into bile. It is a marker of liver function and is used to assess hepatobiliary health. Elevated direct bilirubin levels may indicate liver disorders such as hepatitis, cirrhosis, or biliary obstruction. Direct bilirubin levels are typically measured as part of liver function tests and are used in diagnosing and monitoring liver diseases.",

    "Glucose": "Serum glucose, also known as blood sugar, is the primary source of energy for cells in the body. It is regulated by hormones such as insulin and glucagon and is essential for maintaining normal physiological function. Abnormal glucose levels can indicate underlying medical conditions, such as diabetes mellitus (hyperglycemia) or hypoglycemia. Glucose levels are typically measured as part of comprehensive metabolic panels (CMP) or blood glucose tests and are used in diagnosing and managing diabetes and other metabolic disorders.",

    "Lactate": "Lactic acid, also known as lactate, is a byproduct of anaerobic metabolism in cells. It is produced when cells break down glucose for energy in the absence of sufficient oxygen. Lactate levels can increase during strenuous exercise, hypoxia, shock, or tissue hypoperfusion. Elevated lactate levels may indicate tissue hypoxia or metabolic acidosis and are used as a marker of tissue perfusion and oxygenation in critically ill patients. Lactate levels are typically measured as part of arterial blood gas (ABG) analysis or lactate assays.",

    "Magnesium": "Serum magnesium (Mg2+) is an essential mineral that plays a crucial role in various physiological processes, including muscle and nerve function, energy metabolism, and protein synthesis. It is primarily found in bones and soft tissues and is regulated by the kidneys. Abnormal magnesium levels can indicate underlying medical conditions, such as hypomagnesemia (low magnesium levels) or hypermagnesemia (elevated magnesium levels). Magnesium levels are typically measured as part of comprehensive metabolic panels (CMP) or electrolyte panels.",

    "Phosphate": "Phosphate is an electrolyte essential for various physiological processes, including bone formation, energy metabolism, and acid-base balance. It is primarily found in bones and teeth and is regulated by the kidneys. Abnormal phosphate levels can indicate underlying medical conditions, such as hypophosphatemia (low phosphate levels) or hyperphosphatemia (elevated phosphate levels). Phosphate levels are typically measured as part of comprehensive metabolic panels (CMP) or electrolyte panels.",

    "Potassium": "Serum potassium (K+) is an electrolyte essential for various physiological processes, including muscle and nerve function, fluid balance, and heart rhythm. It is primarily found inside cells and is regulated by the kidneys. Abnormal potassium levels can indicate underlying medical conditions, such as hypokalemia (low potassium levels) or hyperkalemia (elevated potassium levels). Potassium levels are typically measured as part of comprehensive metabolic panels (CMP) or electrolyte panels.",

    "Bilirubin_total": "Total bilirubin is a yellow pigment produced by the breakdown of heme in red blood cells. It is metabolized in the liver and excreted into bile. Total bilirubin levels include both direct (conjugated) and indirect (unconjugated) bilirubin. Elevated total bilirubin levels may indicate liver disorders such as hepatitis, cirrhosis, or biliary obstruction, as well as hemolytic disorders or Gilbert syndrome. Total bilirubin levels are typically measured as part of liver function tests and are used in diagnosing and monitoring liver diseases.",

    "TroponinI": "Troponin I is a protein found in cardiac muscle cells (myocytes) and is released into the bloodstream when these cells are damaged, such as during a heart attack. Troponin I levels rise within hours of myocardial injury and remain elevated for several days, making it a highly sensitive and specific marker for diagnosing acute myocardial infarction (AMI) or other cardiac injuries. Troponin I levels are typically measured using high-sensitivity assays and are used in conjunction with other cardiac markers and clinical assessments to diagnose and manage acute coronary syndromes.",

    "Hct": "Hematocrit (Hct) is a measure of the percentage of red blood cells (erythrocytes) in the total volume of blood. It provides valuable information about the oxygen-carrying capacity of the blood and is used to assess hydration status, anemia, and polycythemia. Hematocrit levels are influenced by factors such as age, sex, altitude, and medical conditions such as dehydration, blood loss, or bone marrow disorders. Hematocrit levels are typically measured as part of complete blood count (CBC) tests.",

    "Hgb": "Hemoglobin (Hgb) is a protein found in red blood cells (erythrocytes) that carries oxygen from the lungs to the tissues and carbon dioxide from the tissues to the lungs. It is essential for oxygen transport and maintaining tissue oxygenation levels. Hemoglobin levels are influenced by factors such as age, sex, altitude, and medical conditions such as anemia or polycythemia. Hemoglobin levels are typically measured as part of complete blood count (CBC) tests and are used in diagnosing and managing various hematological disorders.",

    "PTT": "Partial thromboplastin time (PTT) is a blood test that measures the time it takes for blood to clot. It assesses the integrity of the intrinsic and common coagulation pathways and is used to monitor the effectiveness of anticoagulant therapy, detect coagulation disorders, and assess bleeding risk. PTT is typically measured using plasma samples and is influenced by factors such as clotting factor deficiencies, liver function, and anticoagulant medications. Prolonged PTT may indicate conditions such as hemophilia, disseminated intravascular coagulation (DIC), or von Willebrand disease.",

    "WBC": "The white blood cell count (WBC) measures the number of white blood cells (leukocytes) in a sample of blood. White blood cells are a crucial component of the immune system and play a vital role in defending the body against infection and foreign invaders. Changes in WBC count can indicate underlying medical conditions, such as infection, inflammation, or immune system disorders. WBC count is typically measured as part of complete blood count (CBC) tests and is used in the diagnosis and management of various infectious and inflammatory diseases.",

    "Fibrinogen": "Fibrinogen is a glycoprotein produced by the liver that plays a crucial role in blood clotting and hemostasis. It is converted into fibrin during the coagulation cascade, forming a mesh-like structure that stabilizes blood clots. Fibrinogen levels can indicate the body's ability to form blood clots and are used in assessing bleeding and thrombotic disorders. Elevated fibrinogen levels may indicate acute inflammatory conditions, tissue damage, or increased thrombotic risk. Fibrinogen levels are typically measured using coagulation assays such as the thrombin time or fibrinogen assay.",

    "Platelets": "Platelets, also known as thrombocytes, are small cell fragments produced by megakaryocytes in the bone marrow. They play a crucial role in hemostasis and blood clotting by forming clots at sites of vascular injury. Platelet count measures the number of platelets in a sample of blood and is used to assess bleeding risk and monitor thrombocytopenia or thrombocytosis. Normal platelet count typically ranges from 150,000 to 400,000 platelets per microliter of blood. Platelet count is measured as part of complete blood count (CBC) tests and is used in the diagnosis and management of various bleeding and clotting disorders."
}
